Examinator/src/Documents/ИспользованиеВебКабинетаСУ/ИспользованиеВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИспользованиеВебКабинетаСУ</name>
  <registerRecords>InformationRegister.ИспользованиеВебКабинетаСУ</registerRecords>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСессии</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторВкладки</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейАктивности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Окончено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПериодыДетекции</name>
    <attributes>
      <name>ДатаАктивности</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/InformationRegisters/ИспользованиеВебКабинетаСУ/ИспользованиеВебКабинетаСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИспользованиеВебКабинетаСУ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Documents/ИспользованиеВебКабинетаСУ/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ИспользованиеВебКабинетаСУ.Записывать = Истина;
	
	Если ДатаНачала = ДатаПоследнейАктивности Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.ИспользованиеВебКабинетаСУ.Добавить();
	Движение.Период = Дата;
	Движение.Пользователь = Пользователь;
	Движение.ДатаНачала = ДатаНачала;
	Если ЗначениеЗаполнено(ДатаОкончания) Тогда
		Движение.ДатаОкончания = ДатаОкончания;
	Иначе
		Движение.ДатаОкончания = ДатаПоследнейАктивности;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти


#КонецЕсли
